soap-basic-auth-camel-client/src/main/resources/GetCustomerRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetCustomerRequest xmlns="http://domain.northwind/customer">
      <customerID>ALFKI</customerID>
    </GetCustomerRequest>
  </soap:Body>
</soap:Envelope>